---
kind: enumMember
id: F:Autodesk.Revit.DB.TransmittedModelOptions.SaveAsNewCentral
enum: Autodesk.Revit.DB.TransmittedModelOptions
source: html/d856a44d-2b55-d088-81b6-ddef46994c52.htm
---
# Autodesk.Revit.DB.TransmittedModelOptions.SaveAsNewCentral

The model should be saved as a new central. (On open, it will be
 saved as a new central in its current location. On save, it will be
 saved as central but the user can choose a location.)